src/cf/Catalogs/уатВнешниеСистемы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>уатВнешниеСистемы</Name>
			<Comment>(уат)</Comment>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ТипВнешнейСистемы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.уатТипыВнешнихСистем</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеПС</Name>
					<Comment>(уат)</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Enums/уатТипыВнешнихСистем.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>уатТипыВнешнихСистем</Name>
			<Comment>Типы внешних систем (уат)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>СистемаМониторинга</Name>
					<Comment>Система мониторинга.</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроцессинговыйЦентр</Name>
					<Comment>Процессинговый центр.</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СистемаВзиманияПлаты</Name>
					<Comment>Система взимания платы.</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СервисШтрафов</Name>
					<Comment>Сервис штрафов</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СервисПарковок</Name>
					<Comment>Сервис парковок</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СервисСтрахования</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>СервисГеоданных</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Catalogs/уатВнешниеСистемы/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Выполняет заполнение предопределенных элементов справочника
//
Процедура ЗаполнитьПредопределенныеДанные() Экспорт
	
	СпрОбъект = Справочники.уатВнешниеСистемы._1СЦСМ.ПолучитьОбъект();
	СпрОбъект.ТипВнешнейСистемы = Перечисления.уатТипыВнешнихСистем.СистемаМониторинга;
	СпрОбъект.Записать();
		
	СпрОбъект = Справочники.уатВнешниеСистемы.Omnicomm.ПолучитьОбъект();
	СпрОбъект.ТипВнешнейСистемы = Перечисления.уатТипыВнешнихСистем.СистемаМониторинга;
	СпрОбъект.Записать();

	СпрОбъект = Справочники.уатВнешниеСистемы.Wialon.ПолучитьОбъект();
	СпрОбъект.ТипВнешнейСистемы = Перечисления.уатТипыВнешнихСистем.СистемаМониторинга;
	СпрОбъект.Записать();

	СпрОбъект = Справочники.уатВнешниеСистемы.АвтоГРАФ.ПолучитьОбъект();
	СпрОбъект.ТипВнешнейСистемы = Перечисления.уатТипыВнешнихСистем.СистемаМониторинга;
	СпрОбъект.Записать();
	
	СпрОбъект = Справочники.уатВнешниеСистемы.СКАУТ.ПолучитьОбъект();
	СпрОбъект.ТипВнешнейСистемы = Перечисления.уатТипыВнешнихСистем.СистемаМониторинга;
	СпрОбъект.Записать();
	
	СпрОбъект = Справочники.уатВнешниеСистемы.Газпромнефть.ПолучитьОбъект();
	СпрОбъект.ТипВнешнейСистемы = Перечисления.уатТипыВнешнихСистем.ПроцессинговыйЦентр;
	СпрОбъект.Записать();
	
	СпрОбъект = Справочники.уатВнешниеСистемы.Платон.ПолучитьОбъект();
	СпрОбъект.ТипВнешнейСистемы = Перечисления.уатТипыВнешнихСистем.СистемаВзиманияПлаты;
	СпрОбъект.Записать();
	
	СпрОбъект = Справочники.уатВнешниеСистемы.ШтрафовНет.ПолучитьОбъект();
	СпрОбъект.ТипВнешнейСистемы = Перечисления.уатТипыВнешнихСистем.СервисШтрафов;
	СпрОбъект.Записать();
	
	СпрОбъект = Справочники.уатВнешниеСистемы.Паркоматика.ПолучитьОбъект();
	СпрОбъект.ТипВнешнейСистемы = Перечисления.уатТипыВнешнихСистем.СервисПарковок;
	СпрОбъект.Записать();
	
	СпрОбъект = Справочники.уатВнешниеСистемы.ППР.ПолучитьОбъект();
	СпрОбъект.ТипВнешнейСистемы = Перечисления.уатТипыВнешнихСистем.ПроцессинговыйЦентр;
	СпрОбъект.Записать();
	
	СпрОбъект = Справочники.уатВнешниеСистемы.ЛукойлЛИКАРД.ПолучитьОбъект();
	СпрОбъект.ТипВнешнейСистемы = Перечисления.уатТипыВнешнихСистем.ПроцессинговыйЦентр;
	СпрОбъект.Записать();
	
	СпрОбъект = Справочники.уатВнешниеСистемы.Роснефть.ПолучитьОбъект();
	СпрОбъект.ТипВнешнейСистемы = Перечисления.уатТипыВнешнихСистем.ПроцессинговыйЦентр;
	СпрОбъект.Записать();
	
	СпрОбъект = Справочники.уатВнешниеСистемы.Автодор.ПолучитьОбъект();
	СпрОбъект.ТипВнешнейСистемы = Перечисления.уатТипыВнешнихСистем.СистемаВзиманияПлаты;
	СпрОбъект.Записать();
	
	СпрОбъект = Справочники.уатВнешниеСистемы.СОГАЗ.ПолучитьОбъект();
	СпрОбъект.ТипВнешнейСистемы = Перечисления.уатТипыВнешнихСистем.СервисСтрахования;
	СпрОбъект.Записать();
	
	СпрОбъект = Справочники.уатВнешниеСистемы.OSM.ПолучитьОбъект();
	СпрОбъект.ТипВнешнейСистемы = Перечисления.уатТипыВнешнихСистем.СервисГеоданных;
	СпрОбъект.Записать();

	СпрОбъект = Справочники.уатВнешниеСистемы.Яндекс.ПолучитьОбъект();
	СпрОбъект.ТипВнешнейСистемы = Перечисления.уатТипыВнешнихСистем.СервисГеоданных;
	СпрОбъект.Записать();

	СпрОбъект = Справочники.уатВнешниеСистемы.DaData.ПолучитьОбъект();
	СпрОбъект.ТипВнешнейСистемы = Перечисления.уатТипыВнешнихСистем.СервисГеоданных;
	СпрОбъект.Записать();

	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
